In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
create database if not exists tutorial;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [4]:
%%sql
use tutorial;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [3]:
%%sql
-- Create the table
drop table if exists customer_details;
CREATE TABLE customer_details (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    city VARCHAR(50),
    phone_number VARCHAR(15)
);

-- Insert data into the table
INSERT INTO customer_details (id, customer_name, email, city, phone_number)
VALUES
(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
(2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
(3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
(4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', NULL),
(5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213');

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.ProgrammingError) 1046 (3D000): No database selected
[SQL: -- Create the table
drop table if exists customer_details;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
select * from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Ravi Kumar', 'ravi.kumar@example.com', 'Chennai', '43210'),
 (2, 'Priya Sharma', 'priya.sharma@example.com', 'Bangalore', '43211'),
 (3, 'Arjun Mehta', 'arjun.mehta@example.com', 'Hyderabad', '43212'),
 (4, 'Meena Gupta', 'meena.gupta@example.com', 'Mumbai', None),
 (5, 'Karthik Raj', 'karthik.raj@example.com', 'Chennai', '43213')]

In [13]:
%%sql

select length (customer_name) as Name_length,
upper(city) as City_upper,
lower(customer_name) as cust_lower,
concat (customer_name,city) as nameC,
concat (customer_name,'-',city) as name_C

from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(10, 'CHENNAI', 'ravi kumar', 'Ravi KumarChennai', 'Ravi Kumar-Chennai'),
 (12, 'BANGALORE', 'priya sharma', 'Priya SharmaBangalore', 'Priya Sharma-Bangalore'),
 (11, 'HYDERABAD', 'arjun mehta', 'Arjun MehtaHyderabad', 'Arjun Mehta-Hyderabad'),
 (11, 'MUMBAI', 'meena gupta', 'Meena GuptaMumbai', 'Meena Gupta-Mumbai'),
 (11, 'CHENNAI', 'karthik raj', 'Karthik RajChennai', 'Karthik Raj-Chennai')]

length - one arguement
upper  - one arguement
lower  - One arguement
concat - Multiple arguement
TRIM   - One arguement
LTRIM  - One arguement
RTRIM  - One arguement
substring - Three required

In [22]:
%%sql

select
substring(customer_name,1,6) as name_prefix,
TRIM(customer_name) as trimmed_name,
TRIM('   dummy   ') as TRIM,
LTRIM('  dummy') as Left_TRIM,
RTRIM('dummy   ') as Right_TRIM
from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Ravi K', 'Ravi Kumar', 'dummy', 'dummy', 'dummy'),
 ('Priya ', 'Priya Sharma', 'dummy', 'dummy', 'dummy'),
 ('Arjun ', 'Arjun Mehta', 'dummy', 'dummy', 'dummy'),
 ('Meena ', 'Meena Gupta', 'dummy', 'dummy', 'dummy'),
 ('Karthi', 'Karthik Raj', 'dummy', 'dummy', 'dummy')]

In [30]:
%%sql

select

LPAD(customer_name,15,'*') as Leftt_padded,
RPAD(customer_name,15,'*') as Right_padded,
REPLACE(customer_name,' ','-') as updated_name,
LEFT(customer_name,5) as from_left,
RIGHT(customer_name,5) as from_right

from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('*****Ravi Kumar', 'Ravi Kumar*****', 'Ravi-Kumar', 'Ravi ', 'Kumar'),
 ('***Priya Sharma', 'Priya Sharma***', 'Priya-Sharma', 'Priya', 'harma'),
 ('****Arjun Mehta', 'Arjun Mehta****', 'Arjun-Mehta', 'Arjun', 'Mehta'),
 ('****Meena Gupta', 'Meena Gupta****', 'Meena-Gupta', 'Meena', 'Gupta'),
 ('****Karthik Raj', 'Karthik Raj****', 'Karthik-Raj', 'Karth', 'k Raj')]

In [34]:
%%sql

select

INSTR(customer_name,'a') as position_of_a,
REVERSE(customer_name) as reversed_name,
FORMAT(987654321,2) AS formated_date

from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(2, 'ramuK ivaR', '987,654,321.00'),
 (5, 'amrahS ayirP', '987,654,321.00'),
 (1, 'atheM nujrA', '987,654,321.00'),
 (5, 'atpuG aneeM', '987,654,321.00'),
 (2, 'jaR kihtraK', '987,654,321.00')]

Functions can be nested like programming languages

In [38]:
%%sql
select
upper(concat (customer_name,'-',city)) as name_C
from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('RAVI KUMAR-CHENNAI',),
 ('PRIYA SHARMA-BANGALORE',),
 ('ARJUN MEHTA-HYDERABAD',),
 ('MEENA GUPTA-MUMBAI',),
 ('KARTHIK RAJ-CHENNAI',)]

In [37]:
%%sql
select
length(concat (customer_name,'-',city)) as length_t
from customer_details

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(18,), (22,), (21,), (18,), (19,)]